# Advanced SQL

### Using coalesce function
- The coalesce function, given two or more parameters, returns the first value that is not null

In [1]:
import psycopg2
%load_ext sql

In [2]:
%%sql
postgresql://postgres:password@localhost/advanced_sql

In [3]:
%%sql
select coalesce(NULL, 'test')

 * postgresql://postgres:***@localhost/advanced_sql
1 rows affected.

[('test',)]

In [4]:
%%sql
select coalesce('orange', 'test')

 * postgresql://postgres:***@localhost/advanced_sql
1 rows affected.

[('orange',)]

In [7]:
%%sql
select count(title) from categories

 * postgresql://postgres:***@localhost/advanced_sql
1 rows affected.

[(6,)]

In [10]:
%%sql
select title, coalesce(description, 'No description') from categories
order by description

 * postgresql://postgres:***@localhost/advanced_sql
6 rows affected.

[('apple', 'fruits'),
 ('orange', 'fruits'),
 ('apricot', 'fruits'),
 ('lettuce', 'vegetable'),
 ('tomato', 'vegetable'),
 ('lemon', 'No description')]

In [15]:
%%sql
select count(coalesce(description, 'Bla')) from categories

 * postgresql://postgres:***@localhost/advanced_sql
1 rows affected.

[(5,)]

In [13]:
%%sql
select count(description) from categories

 * postgresql://postgres:***@localhost/advanced_sql
1 rows affected.

[(5,)]

In [16]:
%%sql
select coalesce(description) from categories

 * postgresql://postgres:***@localhost/advanced_sql
6 rows affected.

[('fruits',),
 ('fruits',),
 ('vegetable',),
 (None,),
 ('fruits',),
 ('vegetable',)]

In [38]:
%%sql
select coalesce(lname) from test

 * postgresql://postgres:***@localhost/advanced_sql
4 rows affected.

[(None,), ('doe',), ('doe',), (None,)]

In [33]:
def coalPy(*args, ):
    # print(args)
    for arg in args:
        if arg:
            return arg
    # return "NOTHING"

rows = [[None, None], 
        ['bob', 'doe'],
         [None, 'doe'] ]
    

# coalPy(None,None, 'NOTHING')
for row in rows:
    fname = row[0]
    lname = row[1]
    print(coalPy(fname, lname, 'Nothing'))

Nothing
bob
doe

In [44]:
%%sql
select distinct upper(coalesce(description, 'Nothing')) as "Description"
from categories

 * postgresql://postgres:***@localhost/advanced_sql
3 rows affected.

[('VEGETABLE',), ('FRUITS',), ('NOTHING',)]

- this query returns only different values
- internally the data is sorted
- that means that the query may become slower as the number of rows increases

In [45]:
%%sql
select distinct upper(description) as "Description"
from categories

 * postgresql://postgres:***@localhost/advanced_sql
3 rows affected.

[(None,), ('VEGETABLE',), ('FRUITS',)]

### Using subqueries
- subqueries are nested queries

In [46]:
%%sql
select * from categories where pk=1 or pk=2

 * postgresql://postgres:***@localhost/advanced_sql
2 rows affected.

[(1, 'apple', 'fruits'), (2, 'orange', 'fruits')]

In [48]:
%%sql
select * from categories where pk in (1, 2)

 * postgresql://postgres:***@localhost/advanced_sql
2 rows affected.

[(1, 'apple', 'fruits'), (2, 'orange', 'fruits')]

- get all rows except the rows with pk=1 or pk=2:

In [49]:
%%sql
select * from categories where not (pk=1 or pk=2)

 * postgresql://postgres:***@localhost/advanced_sql
4 rows affected.

[(3, 'lettuce', 'vegetable'),
 (4, 'lemon', None),
 (5, 'apricot', 'fruits'),
 (6, 'tomato', 'vegetable')]

- the *not in* operator reverses the functionality of the *in* operator

In [50]:
%%sql
select * from categories where pk not in (1, 2)

 * postgresql://postgres:***@localhost/advanced_sql
4 rows affected.

[(3, 'lettuce', 'vegetable'),
 (4, 'lemon', None),
 (5, 'apricot', 'fruits'),
 (6, 'tomato', 'vegetable')]

In [54]:
%%sql
select * from posts,categories
where posts.category = categories.pk and categories.title = 'orange'

 * postgresql://postgres:***@localhost/advanced_sql
3 rows affected.

[(1, 'my orange', 'my orange is the best orange in the world', 1, 2, 2, 'orange', 'fruits'),
 (3, 'Re:my orange', "No! It's my orange the best orange in the world", 2, 2, 2, 'orange', 'fruits'),
 (5, 'my new orange', 'this my post on my new orange', 1, 2, 2, 'orange', 'fruits')]

In [55]:
%%sql
select pk, title, content, author, category from posts
where category in 
(select pk from categories where title = 'orange')

 * postgresql://postgres:***@localhost/advanced_sql
3 rows affected.

[(1, 'my orange', 'my orange is the best orange in the world', 1, 2),
 (3, 'Re:my orange', "No! It's my orange the best orange in the world", 2, 2),
 (5, 'my new orange', 'this my post on my new orange', 1, 2)]

In [62]:
%%sql
select pk, title as post_title, content, author, category as category_pk from posts
where category in 
(select pk from categories where title != 'orange')

 * postgresql://postgres:***@localhost/advanced_sql
2 rows affected.

[(2, 'my apple', 'my apple is the best orange in the world', 1, 1),
 (4, 'my tomato', 'my tomato is the best orange in the world', 2, 6)]

In [61]:
%%sql
select pk from categories where title != 'orange'

 * postgresql://postgres:***@localhost/advanced_sql
5 rows affected.

[(1,), (3,), (4,), (5,), (6,)]

In [57]:
%%sql
select pk, title, content, author, category from posts
where category not in 
(select pk from categories where title = 'orange')

 * postgresql://postgres:***@localhost/advanced_sql
2 rows affected.

[(2, 'my apple', 'my apple is the best orange in the world', 1, 1),
 (4, 'my tomato', 'my tomato is the best orange in the world', 2, 6)]

In [58]:
%%sql
select pk from categories where title = 'orange'

 * postgresql://postgres:***@localhost/advanced_sql
1 rows affected.

[(2,)]

## Using the Exists/ Not Exists condition

The Exists statement is used when we want to check whether a subquery returns (True).
For example:

In [59]:
%%sql
select pk, title, content, author, category from posts where 
exists
(select pk from categories where title = 'orange' 
and posts.category = categories.pk )

 * postgresql://postgres:***@localhost/advanced_sql
3 rows affected.

[(1, 'my orange', 'my orange is the best orange in the world', 1, 2),
 (3, 'Re:my orange', "No! It's my orange the best orange in the world", 2, 2),
 (5, 'my new orange', 'this my post on my new orange', 1, 2)]

- Both queries written with the in condition and with the exists condition are called **semi-join queries**.

## Learning joins

- joins are a combination from the rows of two or more tables

For example, the following query returns all the combinations from the rows from the categories and the post table:

In [66]:
%%sql
select c.pk, c.title as cat_title
, p.pk, p.category, p.title as post_title from categories c, 
posts p

 * postgresql://postgres:***@localhost/advanced_sql
30 rows affected.

[(1, 'apple', 1, 2, 'my orange'),
 (2, 'orange', 1, 2, 'my orange'),
 (3, 'lettuce', 1, 2, 'my orange'),
 (4, 'lemon', 1, 2, 'my orange'),
 (5, 'apricot', 1, 2, 'my orange'),
 (6, 'tomato', 1, 2, 'my orange'),
 (1, 'apple', 2, 1, 'my apple'),
 (2, 'orange', 2, 1, 'my apple'),
 (3, 'lettuce', 2, 1, 'my apple'),
 (4, 'lemon', 2, 1, 'my apple'),
 (5, 'apricot', 2, 1, 'my apple'),
 (6, 'tomato', 2, 1, 'my apple'),
 (1, 'apple', 3, 2, 'Re:my orange'),
 (2, 'orange', 3, 2, 'Re:my orange'),
 (3, 'lettuce', 3, 2, 'Re:my orange'),
 (4, 'lemon', 3, 2, 'Re:my orange'),
 (5, 'apricot', 3, 2, 'Re:my orange'),
 (6, 'tomato', 3, 2, 'Re:my orange'),
 (1, 'apple', 4, 6, 'my tomato'),
 (2, 'orange', 4, 6, 'my tomato'),
 (3, 'lettuce', 4, 6, 'my tomato'),
 (4, 'lemon', 4, 6, 'my tomato'),
 (5, 'apricot', 4, 6, 'my tomato'),
 (6, 'tomato', 4, 6, 'my tomato'),
 (1, 'apple', 5, 2, 'my new orange'),
 (2, 'orange', 5, 2, 'my new orange'),
 (3, 'lettuce', 5, 2, 'my new orange'),
 (4, 'lemon', 5, 2, 'my new orange'),
 (5, 'apricot', 5, 2, 'my new orange'),
 (6, 'tomato', 5, 2, 'my new orange')]

- this query makes a cartasian product between categories and posts.
- it can be called **cross join**

it can also be written as:

In [68]:
%%sql
select c.title as c_title, p.title as p_title, p.category from categories as c 
cross join posts as p

 * postgresql://postgres:***@localhost/advanced_sql
30 rows affected.

[('apple', 'my orange', 2),
 ('orange', 'my orange', 2),
 ('lettuce', 'my orange', 2),
 ('lemon', 'my orange', 2),
 ('apricot', 'my orange', 2),
 ('tomato', 'my orange', 2),
 ('apple', 'my apple', 1),
 ('orange', 'my apple', 1),
 ('lettuce', 'my apple', 1),
 ('lemon', 'my apple', 1),
 ('apricot', 'my apple', 1),
 ('tomato', 'my apple', 1),
 ('apple', 'Re:my orange', 2),
 ('orange', 'Re:my orange', 2),
 ('lettuce', 'Re:my orange', 2),
 ('lemon', 'Re:my orange', 2),
 ('apricot', 'Re:my orange', 2),
 ('tomato', 'Re:my orange', 2),
 ('apple', 'my tomato', 6),
 ('orange', 'my tomato', 6),
 ('lettuce', 'my tomato', 6),
 ('lemon', 'my tomato', 6),
 ('apricot', 'my tomato', 6),
 ('tomato', 'my tomato', 6),
 ('apple', 'my new orange', 2),
 ('orange', 'my new orange', 2),
 ('lettuce', 'my new orange', 2),
 ('lemon', 'my new orange', 2),
 ('apricot', 'my new orange', 2),
 ('tomato', 'my new orange', 2)]

![](cross-join.png)

## Using Inner Join
- The inner join keyword selects records that have matching values in both tables.

![](inner_join.png)

#### implicit join

In [70]:

%%sql
select * from categories c, posts p
where c.pk = p.category

 * postgresql://postgres:***@localhost/advanced_sql
5 rows affected.

[(2, 'orange', 'fruits', 1, 'my orange', 'my orange is the best orange in the world', 1, 2),
 (1, 'apple', 'fruits', 2, 'my apple', 'my apple is the best orange in the world', 1, 1),
 (2, 'orange', 'fruits', 3, 'Re:my orange', "No! It's my orange the best orange in the world", 2, 2),
 (6, 'tomato', 'vegetable', 4, 'my tomato', 'my tomato is the best orange in the world', 2, 6),
 (2, 'orange', 'fruits', 5, 'my new orange', 'this my post on my new orange', 1, 2)]

#### explicit join

In [73]:
%%sql
select * from categories c
inner join posts p on c.pk = p.category

 * postgresql://postgres:***@localhost/advanced_sql
5 rows affected.

[(2, 'orange', 'fruits', 1, 'my orange', 'my orange is the best orange in the world', 1, 2),
 (1, 'apple', 'fruits', 2, 'my apple', 'my apple is the best orange in the world', 1, 1),
 (2, 'orange', 'fruits', 3, 'Re:my orange', "No! It's my orange the best orange in the world", 2, 2),
 (6, 'tomato', 'vegetable', 4, 'my tomato', 'my tomato is the best orange in the world', 2, 6),
 (2, 'orange', 'fruits', 5, 'my new orange', 'this my post on my new orange', 1, 2)]

### Inner JOIN versus EXISTS/IN
- Using inner join condition, we can rewrite all queries that can be written using the IN or EXISTS condition.
- the join condition is preferable, because it performs better

In [74]:
%%sql
select * from categories c
inner join posts p on c.pk = p.category
where c.title = 'orange'

 * postgresql://postgres:***@localhost/advanced_sql
3 rows affected.

[(2, 'orange', 'fruits', 1, 'my orange', 'my orange is the best orange in the world', 1, 2),
 (2, 'orange', 'fruits', 3, 'Re:my orange', "No! It's my orange the best orange in the world", 2, 2),
 (2, 'orange', 'fruits', 5, 'my new orange', 'this my post on my new orange', 1, 2)]

### Using Left Joins

In [77]:
%%sql

select * from categories c
left join posts p on p.category = c.pk

 * postgresql://postgres:***@localhost/advanced_sql
8 rows affected.

[(2, 'orange', 'fruits', 1, 'my orange', 'my orange is the best orange in the world', 1, 2),
 (1, 'apple', 'fruits', 2, 'my apple', 'my apple is the best orange in the world', 1, 1),
 (2, 'orange', 'fruits', 3, 'Re:my orange', "No! It's my orange the best orange in the world", 2, 2),
 (6, 'tomato', 'vegetable', 4, 'my tomato', 'my tomato is the best orange in the world', 2, 6),
 (2, 'orange', 'fruits', 5, 'my new orange', 'this my post on my new orange', 1, 2),
 (5, 'apricot', 'fruits', None, None, None, None, None),
 (4, 'lemon', None, None, None, None, None, None),
 (3, 'lettuce', 'vegetable', None, None, None, None, None)]

- this query returns all records of the categories table and returns the matched records
from the post table.
- if the second table (posts) has no matches, the result is null.

![](left-join.png)

In [78]:
%%sql

select * from posts p
left join categories c on p.category = c.pk

 * postgresql://postgres:***@localhost/advanced_sql
6 rows affected.

[(1, 'my orange', 'my orange is the best orange in the world', 1, 2, 2, 'orange', 'fruits'),
 (2, 'my apple', 'my apple is the best orange in the world', 1, 1, 1, 'apple', 'fruits'),
 (3, 'Re:my orange', "No! It's my orange the best orange in the world", 2, 2, 2, 'orange', 'fruits'),
 (4, 'my tomato', 'my tomato is the best orange in the world', 2, 6, 6, 'tomato', 'vegetable'),
 (5, 'my new orange', 'this my post on my new orange', 1, 2, 2, 'orange', 'fruits'),
 (6, 'my banana', 'hello b', 10, 11, None, None, None)]

- Suppose we want to search for all categories that do not have posts:

In [81]:
%%sql
select * from categories c
where c.pk not in
--(select category from posts)
--(2,1,2,6,2,11)
(SELECT * FROM categories c where c.pk IS NULL;)

 * postgresql://postgres:***@localhost/advanced_sql
3 rows affected.

[(3, 'lettuce', 'vegetable'), (4, 'lemon', None), (5, 'apricot', 'fruits')]

In [83]:
%%sql
SELECT * FROM categories c where c.pk IS NULL

 * postgresql://postgres:***@localhost/advanced_sql
0 rows affected.

[]

In [84]:
%%sql

select * from categories c
left join posts p on p.category = c.pk
where p.category is null

 * postgresql://postgres:***@localhost/advanced_sql
3 rows affected.

[(3, 'lettuce', 'vegetable', None, None, None, None, None),
 (4, 'lemon', None, None, None, None, None, None),
 (5, 'apricot', 'fruits', None, None, None, None, None)]

### Using Right join
- we can obtain the same result with right join:

In [85]:
%%sql
select * from posts p
right join categories c on p.category = c.pk

 * postgresql://postgres:***@localhost/advanced_sql
8 rows affected.

[(1, 'my orange', 'my orange is the best orange in the world', 1, 2, 2, 'orange', 'fruits'),
 (2, 'my apple', 'my apple is the best orange in the world', 1, 1, 1, 'apple', 'fruits'),
 (3, 'Re:my orange', "No! It's my orange the best orange in the world", 2, 2, 2, 'orange', 'fruits'),
 (4, 'my tomato', 'my tomato is the best orange in the world', 2, 6, 6, 'tomato', 'vegetable'),
 (5, 'my new orange', 'this my post on my new orange', 1, 2, 2, 'orange', 'fruits'),
 (None, None, None, None, None, 5, 'apricot', 'fruits'),
 (None, None, None, None, None, 4, 'lemon', None),
 (None, None, None, None, None, 3, 'lettuce', 'vegetable')]

![](right-join.png)

### Full outer join

- is the combination of what we would have if we put together the right join and the left join

![](full-join.png)

In [86]:
%%sql
select * from categories c
full join posts p on p.category = c.pk

 * postgresql://postgres:***@localhost/advanced_sql
9 rows affected.

[(2, 'orange', 'fruits', 1, 'my orange', 'my orange is the best orange in the world', 1, 2),
 (1, 'apple', 'fruits', 2, 'my apple', 'my apple is the best orange in the world', 1, 1),
 (2, 'orange', 'fruits', 3, 'Re:my orange', "No! It's my orange the best orange in the world", 2, 2),
 (6, 'tomato', 'vegetable', 4, 'my tomato', 'my tomato is the best orange in the world', 2, 6),
 (2, 'orange', 'fruits', 5, 'my new orange', 'this my post on my new orange', 1, 2),
 (None, None, None, 6, 'my banana', 'hello b', 10, 11),
 (5, 'apricot', 'fruits', None, None, None, None, None),
 (4, 'lemon', None, None, None, None, None, None),
 (3, 'lettuce', 'vegetable', None, None, None, None, None)]

## Multiple joins

In [87]:
%%sql
select * from student

 * postgresql://postgres:***@localhost/advanced_sql
12 rows affected.

[(12, 'Wayne Green', 'New York', None, 1),
 (2, 'Maria Highsmith', 'New York', 3, 1),
 (10, 'John Goldwin', 'Chicago', 6, 2),
 (3, 'Aimaar Abdul', 'Chicago', 1, 2),
 (7, 'Irmgard Seekircher', 'Berlin', 7, 3),
 (5, 'Gerald Hutticher', 'Berlin', 6, 3),
 (4, 'Gudrun Schmidt', 'Berlin', 5, 3),
 (11, 'Emilio Ramiro', 'Barcelona', None, 6),
 (6, 'Itzi Elizabal', 'Barcelona', 4, 6),
 (1, 'Dolores Perez', 'Barcelona', 2, 6),
 (9, 'Alex Anjou', 'Paris', 3, 7),
 (8, 'Christian Blanc', 'Paris', 4, 7)]

In [88]:
%%sql
select * from mentor

 * postgresql://postgres:***@localhost/advanced_sql
9 rows affected.

[(1, 'Peter Smith', 'New York'),
 (2, 'Laura Wild', 'Chicago'),
 (3, 'Julius Maxim', 'Berlin'),
 (4, "Melinda O'Connor", 'Berlin'),
 (5, 'Patricia Boulard', 'Marseille'),
 (6, 'Julia Vila', 'Barcelona'),
 (7, 'Fabienne Martin', 'Paris'),
 (8, 'Rose Dupond', 'Brussels'),
 (9, 'Ahmed Ali', 'Marseille')]

In [89]:
%%sql
select s.name, m.name from student s
left join mentor m on s.mentor_id = m.id
order by s.name

 * postgresql://postgres:***@localhost/advanced_sql
12 rows affected.

[('Aimaar Abdul', 'Peter Smith'),
 ('Alex Anjou', 'Julius Maxim'),
 ('Christian Blanc', "Melinda O'Connor"),
 ('Dolores Perez', 'Laura Wild'),
 ('Emilio Ramiro', None),
 ('Gerald Hutticher', 'Julia Vila'),
 ('Gudrun Schmidt', 'Patricia Boulard'),
 ('Irmgard Seekircher', 'Fabienne Martin'),
 ('Itzi Elizabal', "Melinda O'Connor"),
 ('John Goldwin', 'Julia Vila'),
 ('Maria Highsmith', 'Julius Maxim'),
 ('Wayne Green', None)]

In [90]:
%%sql
select s.name, m.name from student s
left join mentor m on s.local_mentor = m.id
order by s.name

 * postgresql://postgres:***@localhost/advanced_sql
12 rows affected.

[('Aimaar Abdul', 'Laura Wild'),
 ('Alex Anjou', 'Fabienne Martin'),
 ('Christian Blanc', 'Fabienne Martin'),
 ('Dolores Perez', 'Julia Vila'),
 ('Emilio Ramiro', 'Julia Vila'),
 ('Gerald Hutticher', 'Julius Maxim'),
 ('Gudrun Schmidt', 'Julius Maxim'),
 ('Irmgard Seekircher', 'Julius Maxim'),
 ('Itzi Elizabal', 'Julia Vila'),
 ('John Goldwin', 'Laura Wild'),
 ('Maria Highsmith', 'Peter Smith'),
 ('Wayne Green', 'Peter Smith')]

In [92]:
%%sql
select s.name, m1.name, m2.name from student s
left join mentor m1 on s.mentor_id = m1.id
left join mentor m2 on s.local_mentor = m2.id
order by s.name

 * postgresql://postgres:***@localhost/advanced_sql
12 rows affected.

[('Aimaar Abdul', 'Peter Smith', 'Laura Wild'),
 ('Alex Anjou', 'Julius Maxim', 'Fabienne Martin'),
 ('Christian Blanc', "Melinda O'Connor", 'Fabienne Martin'),
 ('Dolores Perez', 'Laura Wild', 'Julia Vila'),
 ('Emilio Ramiro', None, 'Julia Vila'),
 ('Gerald Hutticher', 'Julia Vila', 'Julius Maxim'),
 ('Gudrun Schmidt', 'Patricia Boulard', 'Julius Maxim'),
 ('Irmgard Seekircher', 'Fabienne Martin', 'Julius Maxim'),
 ('Itzi Elizabal', "Melinda O'Connor", 'Julia Vila'),
 ('John Goldwin', 'Julia Vila', 'Laura Wild'),
 ('Maria Highsmith', 'Julius Maxim', 'Peter Smith'),
 ('Wayne Green', None, 'Peter Smith')]

In [93]:
%%sql
select s.name, m1.name, m2.name from student s, mentor m1, mentor m2
where m1.id = s.mentor_id and
m2.id = s.local_mentor
order by s.name

 * postgresql://postgres:***@localhost/advanced_sql
10 rows affected.

[('Aimaar Abdul', 'Peter Smith', 'Laura Wild'),
 ('Alex Anjou', 'Julius Maxim', 'Fabienne Martin'),
 ('Christian Blanc', "Melinda O'Connor", 'Fabienne Martin'),
 ('Dolores Perez', 'Laura Wild', 'Julia Vila'),
 ('Gerald Hutticher', 'Julia Vila', 'Julius Maxim'),
 ('Gudrun Schmidt', 'Patricia Boulard', 'Julius Maxim'),
 ('Irmgard Seekircher', 'Fabienne Martin', 'Julius Maxim'),
 ('Itzi Elizabal', "Melinda O'Connor", 'Julia Vila'),
 ('John Goldwin', 'Julia Vila', 'Laura Wild'),
 ('Maria Highsmith', 'Julius Maxim', 'Peter Smith')]